Revit 2027 API
FamilyItemFactory.NewReferencePoint(Transform) Method
Create a reference point at a given location and with a given coordinate system in an Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferencePoint NewReferencePoint(
	Transform A_0
)
Public Function NewReferencePoint (
	A_0 As Transform
) As ReferencePoint
public:
ReferencePoint^ NewReferencePoint(
	Transform^ A_0
)
member NewReferencePoint :
        A_0 : Transform -> ReferencePoint
Parameters
A_0 Transform
Return Value
ReferencePoint
The newly created ReferencePoint.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the argument is null.
InvalidOperationException |  Thrown when the family is not a Conceptual Mass Family.
See Also
Reference
FamilyItemFactory Class
NewReferencePoint Overload
Autodesk.Revit.Creation Namespace